Terraform Plan for `Directory: edge` and `Workspace: default`:

```
[command]/home/runner/work/_temp/c1d814be-b6c4-4f5d-b0b7-786deda4bf5f/terraform-bin plan -no-color -out=tfplan
aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.example must be replaced
-/+ resource "aws_security_group" "example" {
      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)
      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_security_group.example must be replaced%0A-/+ resource "aws_security_group" "example" {%0A      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)%0A      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)%0A      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "788932519567" -> (known after apply)%0A        tags                   = {%0A            "Name" = "example-security-group"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0AChanges to Outputs:%0A  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_5695a301-06ae-434e-94fd-79ae9ab33918
aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.example must be replaced
-/+ resource "aws_security_group" "example" {
      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)
      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

ghadelimiter_5695a301-06ae-434e-94fd-79ae9ab33918
stderr<<ghadelimiter_8c6750b5-45eb-47df-829f-80a9f2cd9159

ghadelimiter_8c6750b5-45eb-47df-829f-80a9f2cd9159
exitcode<<ghadelimiter_0691e789-334e-406d-a9c3-75ef025e4ba6
0
ghadelimiter_0691e789-334e-406d-a9c3-75ef025e4ba6
```

Plan saved to GitHub artifacts.